MusaMahmood/nRF52_GSR/main.c
#define CONN_CFG_TAG 1 /**< A tag that refers to the BLE stack configuration we set with @ref sd_ble_cfg_set. Default tag is @ref BLE_CONN_CFG_TAG_DEFAULT. */

#define FIRST_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(5000) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(30000) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT 3                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define HVN_TX_QUEUE_SIZE 32 //16

#define SEC_PARAM_BOND 1                               /**< Perform bonding. */
#define SEC_PARAM_MITM 0                               /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC 0                               /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS 0                           /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES BLE_GAP_IO_CAPS_NONE /**< No I/O capabilities. */
#define SEC_PARAM_OOB 0                                /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE 7                       /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE 16                      /**< Maximum encryption key size. */

#define DEAD_BEEF 0xDEADBEEF /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */
static nrf_ble_gatt_t m_gatt;                            /**< GATT module instance. */

static ble_uuid_t m_adv_uuids[] =
    {
        {BLE_UUID_SG_MEASUREMENT_SERVICE, BLE_UUID_TYPE_BLE},
        {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}}; /**< Universally unique service identifiers. */

static void advertising_start(void);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name) {
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**
 * @brief Function for handling data from temperature sensor.
 *
 * @param[in] temp          Temperature in Celsius degrees read from sensor.
 */
__STATIC_INLINE void data_handler(uint16_t temp) {
  int16_t data = temp;
  data = ((data << 8) & 0xff00) | ((data >> 8) & 0x00ff);
  m_temp_sample_buffer[m_temp_sample_counter] = data;
  m_temp_sample_counter++;
  if (m_temp_sample_counter == 4) {
    m_temp_sample_counter = 0;
    // Average:
    int sum = 0;
    int i;
    for (i = 0; i < SAMPLES_IN_BUFFER; i++) {
      sum += m_temp_sample_buffer[i];
    }
    int average = sum / 4;
    NRF_LOG_INFO("Temperature: %d (as int).\r\n", average);
    data_to_write[1] = (int16_t)average;
  }
}

/**
 * @brief TWI events handler.
 */
void twi_handler(nrf_drv_twi_evt_t const *p_event, void *p_context) {
  switch (p_event->type) {
  case NRF_DRV_TWI_EVT_DONE:
    if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_RX) {
      data_handler(m_sample);
    }
    m_xfer_done = true;
    break;
  default:
    break;
  }
}

/**
 * @brief Function for reading data from temperature sensor.
 */
static void read_sensor_data() {
  m_xfer_done = false;

  /* Read 1 byte from the specified address - skip 3 bits dedicated for fractional part of temperature. */
  ret_code_t err_code = nrf_drv_twi_rx(&m_twi, TMP116_ADDR, (uint8_t *)&m_sample, sizeof(m_sample));
  APP_ERROR_CHECK(err_code);
}

static void saadc_sample_update(void) {
// CALL SAADC
#if defined(SAADC_ENABLED) && SAADC_ENABLED == 1
  //Sample with ADC
  nrf_drv_saadc_sample();
#endif
}

static void fatfs_write_data(void) {
  FRESULT ff_result;
  static FIL file;
  uint32_t bytes_written;

  NRF_LOG_INFO("Writing to file " FILE_NAME "...\r\n");
  ff_result = f_open(&file, FILE_NAME, FA_READ | FA_WRITE | FA_OPEN_APPEND);
  if (ff_result != FR_OK) {
    NRF_LOG_INFO("Unable to open or create file: " FILE_NAME ".\r\n");
    return;
  }
  // Break into individual bytes:
  uint8_t data_array_bytes[4];
  memcpy(&data_array_bytes[0], &data_to_write[0], 4);
  ff_result = f_write(&file, data_array_bytes, 4, (UINT *)&bytes_written);
  if (ff_result != FR_OK) {
    NRF_LOG_INFO("Write failed\r\n.");
  } else {
    NRF_LOG_INFO("%d bytes written.\r\n", bytes_written);
  }

  (void)f_close(&file);
}

#if defined(APP_TIMER_SAMPLING) && APP_TIMER_SAMPLING == 1
static void m_sampling_timeout_handler(void *p_context) {
  UNUSED_PARAMETER(p_context);
#if defined(APP_TIMER_SAMPLING) && APP_TIMER_SAMPLING == 1
  // ADC Sample : GSR:
  saadc_sample_update();

  do {
    __WFE();
  } while (m_xfer_done == false);
  // Read From Temp Sensor via TWI:
  read_sensor_data();
  // TODO: Save Data To uSD Card, only keep 4th averaged value.
  count_number_samples++;
  if (count_number_samples == 4) {
    count_number_samples = 0;
    fatfs_write_data();
  }

#endif
}
#endif

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void) {
  // Initialize timer module..
  //Create timers
  ret_code_t err_code = app_timer_init();
  APP_ERROR_CHECK(err_code);

#if defined(APP_TIMER_SAMPLING) && APP_TIMER_SAMPLING == 1
  err_code = app_timer_create(&m_sampling_timer_id, APP_TIMER_MODE_REPEATED, m_sampling_timeout_handler);
  APP_ERROR_CHECK(err_code);
#endif
}

